0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 210 0 0 );

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ( 210 0 0 );
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform ( 210 0 0 );
        value           uniform ( 210 0 0 );
    }
    bottom
    {
        type            symmetry;
    }
    top
    {
        type            symmetry;
    }
    obstacle
    {
        type            slip;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
